zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_gc00/include/pic32cm5112gc00048.h
/* CMSIS includes */
#include "core_cm23.h"
#if defined USE_CMSIS_INIT
#include "system_pic32cmgc00.h"
#endif /* USE_CMSIS_INIT */

/* ************************************************************************** */
/*         SOFTWARE PERIPHERAL API DEFINITIONS FOR PIC32CM5112GC00048         */
/* ************************************************************************** */
#include "component/ac.h"
#include "component/adc.h"
#include "component/at.h"
#include "component/bromc.h"
#include "component/can.h"
#include "component/ccl.h"
#include "component/dmac.h"
#include "component/dsu.h"
#include "component/eic.h"
#include "component/evsys.h"
#include "component/fcr.h"
#include "component/fcw.h"
#include "component/freqm.h"
#include "component/fuses.h"
#include "component/gclk.h"
#include "component/h2pb.h"
#include "component/hmatrix2.h"
#include "component/mclk.h"
#include "component/mcramc.h"
#include "component/osc32kctrl.h"
#include "component/oscctrl.h"
#include "component/pac.h"
#include "component/pm.h"
#include "component/port.h"
#include "component/ptc.h"
#include "component/rstc.h"
#include "component/rtc.h"
#include "component/sercom.h"
#include "component/supc.h"
#include "component/tcc.h"
#include "component/usb.h"
#include "component/wdt.h"

/* ************************************************************************** */
/*                INSTANCE DEFINITIONS FOR PIC32CM5112GC00048                 */
/* ************************************************************************** */
#include "instance/ac.h"
#include "instance/adc.h"
#include "instance/at.h"
#include "instance/bromc.h"
#include "instance/can0.h"
#include "instance/can1.h"
#include "instance/ccl0.h"
#include "instance/ccl1.h"
#include "instance/dmac.h"
#include "instance/dsu.h"
#include "instance/eic.h"
#include "instance/evsys.h"
#include "instance/fcr.h"
#include "instance/fcw.h"
#include "instance/freqm.h"
#include "instance/fuses.h"
#include "instance/gclk.h"
#include "instance/h2pb0.h"
#include "instance/h2pb1.h"
#include "instance/h2pb2.h"
#include "instance/hmatrix2.h"
#include "instance/mclk.h"
#include "instance/mcramc.h"
#include "instance/osc32kctrl.h"
#include "instance/oscctrl.h"
#include "instance/pac.h"
#include "instance/pm.h"
#include "instance/port.h"
#include "instance/ptc.h"
#include "instance/rstc.h"
#include "instance/rtc.h"
#include "instance/sercom0.h"
#include "instance/sercom1.h"
#include "instance/sercom2.h"
#include "instance/sercom3.h"
#include "instance/sercom4.h"
#include "instance/sercom5.h"
#include "instance/supc.h"
#include "instance/tcc0.h"
#include "instance/tcc1.h"
#include "instance/tcc2.h"
#include "instance/tcc3.h"
#include "instance/tcc4.h"
#include "instance/tcc5.h"
#include "instance/tcc6.h"
#include "instance/usb.h"
#include "instance/wdt.h"

/* ************************************************************************** */
/*              PERIPHERAL ID DEFINITIONS FOR PIC32CM5112GC00048              */
/* ************************************************************************** */
#define ID_DSU           (  0) /* Instance index for DSU (DSU) */
#define ID_FCR           (  1) /* Instance index for FCR (FCR) */
#define ID_FCW           (  2) /* Instance index for FCW (FCW) */
#define ID_PM            (  3) /* Instance index for PM (PM) */
#define ID_SUPC          (  4) /* Instance index for SUPC (SUPC) */
#define ID_RSTC          (  5) /* Instance index for RSTC (RSTC) */
#define ID_OSCCTRL       (  6) /* Instance index for OSCCTRL (OSCCTRL) */
#define ID_OSC32KCTRL    (  7) /* Instance index for OSC32KCTRL (OSC32KCTRL) */
#define ID_GCLK          (  8) /* Instance index for GCLK (GCLK) */
#define ID_MCLK          (  9) /* Instance index for MCLK (MCLK) */
#define ID_FREQM         ( 10) /* Instance index for FREQM (FREQM) */
#define ID_WDT           ( 11) /* Instance index for WDT (WDT) */
#define ID_RTC           ( 12) /* Instance index for RTC (RTC) */
#define ID_EIC           ( 13) /* Instance index for EIC (EIC) */
#define ID_PAC           ( 14) /* Instance index for PAC (PAC) */
#define ID_MCRAMC        ( 16) /* Instance index for MCRAMC (MCRAMC) */
#define ID_CAN0          ( 17) /* Instance index for CAN0 (CAN0) */
#define ID_CAN1          ( 18) /* Instance index for CAN1 (CAN1) */
#define ID_H2PB0         ( 19) /* Instance index for H2PB0 (H2PB0) */
#define ID_PORT          ( 20) /* Instance index for PORT (PORT) */
#define ID_DMAC          ( 21) /* Instance index for DMAC (DMAC) */
#define ID_HMATRIX2      ( 22) /* Instance index for HMATRIX2 (HMATRIX2) */
#define ID_BROMC         ( 23) /* Instance index for BROMC (BROMC) */
#define ID_EVSYS         ( 25) /* Instance index for EVSYS (EVSYS) */
#define ID_SERCOM0       ( 26) /* Instance index for SERCOM0 (SERCOM0) */
#define ID_SERCOM1       ( 27) /* Instance index for SERCOM1 (SERCOM1) */
#define ID_SERCOM2       ( 28) /* Instance index for SERCOM2 (SERCOM2) */
#define ID_SERCOM3       ( 29) /* Instance index for SERCOM3 (SERCOM3) */
#define ID_TCC0          ( 30) /* Instance index for TCC0 (TCC0) */
#define ID_TCC1          ( 31) /* Instance index for TCC1 (TCC1) */
#define ID_TCC2          ( 32) /* Instance index for TCC2 (TCC2) */
#define ID_TCC3          ( 33) /* Instance index for TCC3 (TCC3) */
#define ID_SERCOM4       ( 34) /* Instance index for SERCOM4 (SERCOM4) */
#define ID_SERCOM5       ( 35) /* Instance index for SERCOM5 (SERCOM5) */
#define ID_TCC4          ( 36) /* Instance index for TCC4 (TCC4) */
#define ID_TCC5          ( 37) /* Instance index for TCC5 (TCC5) */
#define ID_TCC6          ( 38) /* Instance index for TCC6 (TCC6) */
#define ID_ADC           ( 39) /* Instance index for ADC (ADC) */
#define ID_AC            ( 40) /* Instance index for AC (AC) */
#define ID_PTC           ( 41) /* Instance index for PTC (PTC) */
#define ID_CCL0          ( 42) /* Instance index for CCL0 (CCL0) */
#define ID_CCL1          ( 43) /* Instance index for CCL1 (CCL1) */
#define ID_USB           ( 44) /* Instance index for USB (USB) */
#define ID_AT            ( 45) /* Instance index for AT (AT) */
#define ID_H2PB1         ( 46) /* Instance index for H2PB1 (H2PB1) */
#define ID_H2PB2         ( 47) /* Instance index for H2PB2 (H2PB2) */

#define ID_PERIPH_MAX    ( 47) /* Number of peripheral IDs */

/* ************************************************************************** */
/*       REGISTER STRUCTURE ADDRESS DEFINITIONS FOR PIC32CM5112GC00048        */
/* ************************************************************************** */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#define AC_REGS                          ((ac_registers_t*)0x4482a000)                 /* AC Registers Address         */
#define ADC_REGS                         ((adc_registers_t*)0x44818000)                /* ADC Registers Address        */
#define AT_REGS                          ((at_registers_t*)0x4500c000)                 /* AT Registers Address         */
#define BROMC_REGS                       ((bromc_registers_t*)0x44804000)              /* BROMC Registers Address      */
#define CAN0_REGS                        ((can_registers_t*)0x4402e000)                /* CAN0 Registers Address       */
#define CAN1_REGS                        ((can_registers_t*)0x44030000)                /* CAN1 Registers Address       */
#define CCL0_REGS                        ((ccl_registers_t*)0x4482e000)                /* CCL0 Registers Address       */
#define CCL1_REGS                        ((ccl_registers_t*)0x44830000)                /* CCL1 Registers Address       */
#define DMAC_REGS                        ((dmac_registers_t*)0x44802000)               /* DMAC Registers Address       */
#define DSU_REGS                         ((dsu_registers_t*)0x44000000)                /* DSU Registers Address        */
#define EIC_REGS                         ((eic_registers_t*)0x44020000)                /* EIC Registers Address        */
#define EVSYS_REGS                       ((evsys_registers_t*)0x44806000)              /* EVSYS Registers Address      */
#define FCR_REGS                         ((fcr_registers_t*)0x44002000)                /* FCR Registers Address        */
#define FCW_REGS                         ((fcw_registers_t*)0x44004000)                /* FCW Registers Address        */
#define FREQM_REGS                       ((freqm_registers_t*)0x4400c000)              /* FREQM Registers Address      */
#define FUSES_ROMCFG_REGS                ((fuses_romcfg_registers_t*)0x0a003000)       /* FUSES Registers Address      */
#define FUSES_BOOTCFG1_REGS              ((fuses_bootcfg1_registers_t*)0x0a002000)     /* FUSES Registers Address      */
#define FUSES_BOOTCFG1A_REGS             ((fuses_bootcfg1_registers_t*)0x0a000000)     /* FUSES Registers Address      */
#define FUSES_CALOTP_REGS                ((fuses_calotp_registers_t*)0x0a007000)       /* FUSES Registers Address      */
#define GCLK_REGS                        ((gclk_registers_t*)0x44008000)               /* GCLK Registers Address       */
#define H2PB0_REGS                       ((h2pb_registers_t*)0x44032000)               /* H2PB0 Registers Address      */
#define H2PB1_REGS                       ((h2pb_registers_t*)0x44838000)               /* H2PB1 Registers Address      */
#define H2PB2_REGS                       ((h2pb_registers_t*)0x4500e000)               /* H2PB2 Registers Address      */
#define HMATRIX2_REGS                    ((hmatrix2_registers_t*)0x44010000)           /* HMATRIX2 Registers Address   */
#define MCLK_REGS                        ((mclk_registers_t*)0x4400a000)               /* MCLK Registers Address       */
#define MCRAMC_REGS                      ((mcramc_registers_t*)0x4402c000)             /* MCRAMC Registers Address     */
#define OSC32KCTRL_REGS                  ((osc32kctrl_registers_t*)0x45008000)         /* OSC32KCTRL Registers Address */
#define OSCCTRL_REGS                     ((oscctrl_registers_t*)0x44006000)            /* OSCCTRL Registers Address    */
#define PAC_REGS                         ((pac_registers_t*)0x44022000)                /* PAC Registers Address        */
#define PM_REGS                          ((pm_registers_t*)0x45000000)                 /* PM Registers Address         */
#define PORT_REGS                        ((port_registers_t*)0x44800000)               /* PORT Registers Address       */
#define PTC_REGS                         ((ptc_registers_t*)0x4482c000)                /* PTC Registers Address        */
#define RSTC_REGS                        ((rstc_registers_t*)0x45004000)               /* RSTC Registers Address       */
#define RTC_REGS                         ((rtc_registers_t*)0x45006000)                /* RTC Registers Address        */
#define SERCOM0_REGS                     ((sercom_registers_t*)0x44808000)             /* SERCOM0 Registers Address    */
#define SERCOM1_REGS                     ((sercom_registers_t*)0x4480a000)             /* SERCOM1 Registers Address    */
#define SERCOM2_REGS                     ((sercom_registers_t*)0x4480c000)             /* SERCOM2 Registers Address    */
#define SERCOM3_REGS                     ((sercom_registers_t*)0x4480e000)             /* SERCOM3 Registers Address    */
#define SERCOM4_REGS                     ((sercom_registers_t*)0x44820000)             /* SERCOM4 Registers Address    */
#define SERCOM5_REGS                     ((sercom_registers_t*)0x44822000)             /* SERCOM5 Registers Address    */
#define SUPC_REGS                        ((supc_registers_t*)0x45002000)               /* SUPC Registers Address       */
#define TCC0_REGS                        ((tcc_registers_t*)0x44810000)                /* TCC0 Registers Address       */
#define TCC1_REGS                        ((tcc_registers_t*)0x44812000)                /* TCC1 Registers Address       */
#define TCC2_REGS                        ((tcc_registers_t*)0x44814000)                /* TCC2 Registers Address       */
#define TCC3_REGS                        ((tcc_registers_t*)0x44816000)                /* TCC3 Registers Address       */
#define TCC4_REGS                        ((tcc_registers_t*)0x44824000)                /* TCC4 Registers Address       */
#define TCC5_REGS                        ((tcc_registers_t*)0x44826000)                /* TCC5 Registers Address       */
#define TCC6_REGS                        ((tcc_registers_t*)0x44828000)                /* TCC6 Registers Address       */
#define USB_REGS                         ((usb_registers_t*)0x44832000)                /* USB Registers Address        */
#define WDT_REGS                         ((wdt_registers_t*)0x4400e000)                /* WDT Registers Address        */
#endif /* (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

/* ************************************************************************** */
/*              BASE ADDRESS DEFINITIONS FOR PIC32CM5112GC00048               */
/* ************************************************************************** */
#define AC_BASE_ADDRESS                  _UINT32_(0x4482a000)                          /* AC Base Address */
#define ADC_BASE_ADDRESS                 _UINT32_(0x44818000)                          /* ADC Base Address */
#define AT_BASE_ADDRESS                  _UINT32_(0x4500c000)                          /* AT Base Address */
#define BROMC_BASE_ADDRESS               _UINT32_(0x44804000)                          /* BROMC Base Address */
#define CAN0_BASE_ADDRESS                _UINT32_(0x4402e000)                          /* CAN0 Base Address */
#define CAN1_BASE_ADDRESS                _UINT32_(0x44030000)                          /* CAN1 Base Address */
#define CCL0_BASE_ADDRESS                _UINT32_(0x4482e000)                          /* CCL0 Base Address */
#define CCL1_BASE_ADDRESS                _UINT32_(0x44830000)                          /* CCL1 Base Address */
#define DMAC_BASE_ADDRESS                _UINT32_(0x44802000)                          /* DMAC Base Address */
#define DSU_BASE_ADDRESS                 _UINT32_(0x44000000)                          /* DSU Base Address */
#define EIC_BASE_ADDRESS                 _UINT32_(0x44020000)                          /* EIC Base Address */
#define EVSYS_BASE_ADDRESS               _UINT32_(0x44806000)                          /* EVSYS Base Address */
#define FCR_BASE_ADDRESS                 _UINT32_(0x44002000)                          /* FCR Base Address */
#define FCW_BASE_ADDRESS                 _UINT32_(0x44004000)                          /* FCW Base Address */
#define FREQM_BASE_ADDRESS               _UINT32_(0x4400c000)                          /* FREQM Base Address */
#define FUSES_ROMCFG_BASE_ADDRESS        _UINT32_(0x0a003000)                          /* FUSES Base Address */
#define FUSES_BOOTCFG1_BASE_ADDRESS      _UINT32_(0x0a002000)                          /* FUSES Base Address */
#define FUSES_BOOTCFG1A_BASE_ADDRESS     _UINT32_(0x0a000000)                          /* FUSES Base Address */
#define FUSES_CALOTP_BASE_ADDRESS        _UINT32_(0x0a007000)                          /* FUSES Base Address */
#define GCLK_BASE_ADDRESS                _UINT32_(0x44008000)                          /* GCLK Base Address */
#define H2PB0_BASE_ADDRESS               _UINT32_(0x44032000)                          /* H2PB0 Base Address */
#define H2PB1_BASE_ADDRESS               _UINT32_(0x44838000)                          /* H2PB1 Base Address */
#define H2PB2_BASE_ADDRESS               _UINT32_(0x4500e000)                          /* H2PB2 Base Address */
#define HMATRIX2_BASE_ADDRESS            _UINT32_(0x44010000)                          /* HMATRIX2 Base Address */
#define MCLK_BASE_ADDRESS                _UINT32_(0x4400a000)                          /* MCLK Base Address */
#define MCRAMC_BASE_ADDRESS              _UINT32_(0x4402c000)                          /* MCRAMC Base Address */
#define OSC32KCTRL_BASE_ADDRESS          _UINT32_(0x45008000)                          /* OSC32KCTRL Base Address */
#define OSCCTRL_BASE_ADDRESS             _UINT32_(0x44006000)                          /* OSCCTRL Base Address */
#define PAC_BASE_ADDRESS                 _UINT32_(0x44022000)                          /* PAC Base Address */
#define PM_BASE_ADDRESS                  _UINT32_(0x45000000)                          /* PM Base Address */
#define PORT_BASE_ADDRESS                _UINT32_(0x44800000)                          /* PORT Base Address */
#define PTC_BASE_ADDRESS                 _UINT32_(0x4482c000)                          /* PTC Base Address */
#define RSTC_BASE_ADDRESS                _UINT32_(0x45004000)                          /* RSTC Base Address */
#define RTC_BASE_ADDRESS                 _UINT32_(0x45006000)                          /* RTC Base Address */
#define SERCOM0_BASE_ADDRESS             _UINT32_(0x44808000)                          /* SERCOM0 Base Address */
#define SERCOM1_BASE_ADDRESS             _UINT32_(0x4480a000)                          /* SERCOM1 Base Address */
#define SERCOM2_BASE_ADDRESS             _UINT32_(0x4480c000)                          /* SERCOM2 Base Address */
#define SERCOM3_BASE_ADDRESS             _UINT32_(0x4480e000)                          /* SERCOM3 Base Address */
#define SERCOM4_BASE_ADDRESS             _UINT32_(0x44820000)                          /* SERCOM4 Base Address */
#define SERCOM5_BASE_ADDRESS             _UINT32_(0x44822000)                          /* SERCOM5 Base Address */
#define SUPC_BASE_ADDRESS                _UINT32_(0x45002000)                          /* SUPC Base Address */
#define TCC0_BASE_ADDRESS                _UINT32_(0x44810000)                          /* TCC0 Base Address */
#define TCC1_BASE_ADDRESS                _UINT32_(0x44812000)                          /* TCC1 Base Address */
#define TCC2_BASE_ADDRESS                _UINT32_(0x44814000)                          /* TCC2 Base Address */
#define TCC3_BASE_ADDRESS                _UINT32_(0x44816000)                          /* TCC3 Base Address */
#define TCC4_BASE_ADDRESS                _UINT32_(0x44824000)                          /* TCC4 Base Address */
#define TCC5_BASE_ADDRESS                _UINT32_(0x44826000)                          /* TCC5 Base Address */
#define TCC6_BASE_ADDRESS                _UINT32_(0x44828000)                          /* TCC6 Base Address */
#define USB_BASE_ADDRESS                 _UINT32_(0x44832000)                          /* USB Base Address */
#define WDT_BASE_ADDRESS                 _UINT32_(0x4400e000)                          /* WDT Base Address */

/* ************************************************************************** */
/*                   PIO DEFINITIONS FOR PIC32CM5112GC00048                   */
/* ************************************************************************** */
#include "pio/pic32cm5112gc00048.h"

/* ************************************************************************** */
/*             MEMORY MAPPING DEFINITIONS FOR PIC32CM5112GC00048              */
/* ************************************************************************** */
#define BROMC_ROM_SIZE                 _UINT32_(0x00010000)    /*   64kB Memory segment type: rom */
#define FCR_BFM_SIZE                   _UINT32_(0x00004000)    /*   16kB Memory segment type: flash */
#define FCR_CFM_BOOTCFG1A_SIZE         _UINT32_(0x00001000)    /*    4kB Memory segment type: flash */
#define FCR_CFM_USEROTP_SIZE           _UINT32_(0x00001000)    /*    4kB Memory segment type: user_signatures */
#define FCR_CFM_BOOTCFG1_SIZE          _UINT32_(0x00001000)    /*    4kB Memory segment type: flash */
#define FCR_CFM_ROMCFG_SIZE            _UINT32_(0x00001000)    /*    4kB Memory segment type: flash */
#define FCR_CFM_VSS0_SIZE              _UINT32_(0x00001000)    /*    4kB Memory segment type: flash */
#define FCR_CFM_VSS1_SIZE              _UINT32_(0x00001000)    /*    4kB Memory segment type: flash */
#define FCR_CFM_TEST_SIZE              _UINT32_(0x00001000)    /*    4kB Memory segment type: flash */
#define FCR_CFM_CALOTP_SIZE            _UINT32_(0x00001000)    /*    4kB Memory segment type: other */
#define FCR_PFM_SIZE                   _UINT32_(0x00080000)    /*  512kB Memory segment type: flash */
#define MCRAMC_RET_SIZE                _UINT32_(0x00020000)    /*  128kB Memory segment type: ram */
#define APB0_BRIDGE_SIZE               _UINT32_(0x00034000)    /*  208kB Memory segment type: io */
#define APB1_BRIDGE_SIZE               _UINT32_(0x0003a000)    /*  232kB Memory segment type: io */
#define APB2_BRIDGE_SIZE               _UINT32_(0x00010000)    /*   64kB Memory segment type: io */
#define PPB_SIZE                       _UINT32_(0x00100000)    /* 1024kB Memory segment type: io */

